{"0": "[PAD]", "1": "[UNK]", "2": "[CLS]", "3": "[SEP]", "4": "[MASK]", "5": "\u2581!", "6": "\u2581%", "7": "\u2581&", "8": "\u2581(", "9": "\u2581)", "10": "\u2581*", "11": "\u2581+", "12": "\u2581,", "13": "\u2581-", "14": "\u2581.", "15": "\u2581/", "16": "\u25810", "17": "\u25811", "18": "\u25812", "19": "\u25813", "20": "\u25814", "21": "\u25815", "22": "\u25816", "23": "\u25817", "24": "\u25818", "25": "\u25819", "26": "\u2581:", "27": "\u2581a", "28": "\u2581b", "29": "\u2581c", "30": "\u2581d", "31": "\u2581e", "32": "\u2581f", "33": "\u2581g", "34": "\u2581h", "35": "\u2581i", "36": "\u2581j", "37": "\u2581k", "38": "\u2581l", "39": "\u2581m", "40": "\u2581n", "41": "\u2581o", "42": "\u2581p", "43": "\u2581q", "44": "\u2581r", "45": "\u2581s", "46": "\u2581t", "47": "\u2581u", "48": "\u2581v", "49": "\u2581w", "50": "\u2581x", "51": "\u2581y", "52": "\u2581z", "53": "\u2581\u060c", "54": "\u2581\u061b", "55": "\u2581\u061f", "56": "\u2581\u0621", "57": "\u2581\u0622", "58": "\u2581\u0623", "59": "\u2581\u0624", "60": "\u2581\u0625", "61": "\u2581\u0626", "62": "\u2581\u0627", "63": "\u2581\u0628", "64": "\u2581\u0629", "65": "\u2581\u062a", "66": "\u2581\u062b", "67": "\u2581\u062c", "68": "\u2581\u062d", "69": "\u2581\u062e", "70": "\u2581\u062f", "71": "\u2581\u0630", "72": "\u2581\u0631", "73": "\u2581\u0632", "74": "\u2581\u0633", "75": "\u2581\u0634", "76": "\u2581\u0635", "77": "\u2581\u0636", "78": "\u2581\u0637", "79": "\u2581\u0638", "80": "\u2581\u0639", "81": "\u2581\u063a", "82": "\u2581\u063b", "83": "\u2581\u063c", "84": "\u2581\u063d", "85": "\u2581\u063f", "86": "\u2581\u0641", "87": "\u2581\u0642", "88": "\u2581\u0643", "89": "\u2581\u0644", "90": "\u2581\u0645", "91": "\u2581\u0646", "92": "\u2581\u0647", "93": "\u2581\u0648", "94": "\u2581\u0649", "95": "\u2581\u064a", "96": "\u0648", "97": "\u0646", "98": "\u0633", "99": "\u0627", "100": "\u0631", "101": "\u0643", "102": "\u0645", "103": "1", "104": "a", "105": "j", "106": "6", "107": "n", "108": "i", "109": "\u0628", "110": "\u0644", "111": "\u0634", "112": "\u0623", "113": "\u062f", "114": "\u064a", "115": "\u0647", "116": "\u0649", "117": "u", "118": "r", "119": "e", "120": "m", "121": "b", "122": "g", "123": "5", "124": "2", "125": "0", "126": "\u062e", "127": "\u062a", "128": "p", "129": "f", "130": "o", "131": "s", "132": "t", "133": "l", "134": "\u0641", "135": "y", "136": "q", "137": "\u062c", "138": "\u062d", "139": "\u0635", "140": "\u0639", "141": "8", "142": "7", "143": "3", "144": "z", "145": "\u0642", "146": "\u0629", "147": "\u0625", "148": "\u0636", "149": "\u0632", "150": "\u0637", "151": "\u0626", "152": "h", "153": "d", "154": "\u0624", "155": "9", "156": "4", "157": "\u0630", "158": "\u0622", "159": "k", "160": "x", "161": "\u0621", "162": "\u062b", "163": "v", "164": "w", "165": "\u063a", "166": "\u0638", "167": "c", "168": "\u063d", "169": "\u063f", "170": "\u063c", "171": "\u2581\u0627\u0644", "172": "\u0627\u0644", "173": "\u064a\u0629", "174": "\u2581\u0627\u0644\u0645", "175": "\u0627\u062a", "176": "\u2581\u0641\u064a", "177": "\u0627\u0646", "178": "\u0627\u0631", "179": "\u2581\u0645\u0646", "180": "\u064a\u0646", "181": "\u0627\u0645", "182": "\u0647\u0627", "183": "\u0644\u0649", "184": "\u064a\u0631", "185": "\u2581\u0648\u0627\u0644", "186": "\u0648\u0644", "187": "\u2581\u0627\u0644\u062a", "188": "\u0627\u062f", "189": "\u0631\u064a", "190": "\u2581\u0627\u0644\u0639", "191": "\u0631\u0627", "192": "\u0648\u0646", "193": "\u0644\u064a", "194": "\u0645\u0627", "195": "\u2581\u0627\u0644\u0623", "196": "\u0633\u062a", "197": "\u0644\u0627", "198": "\u0646\u0627", "199": "\u2581\u0639\u0644\u0649", "200": "\u0627\u0628", "201": "\u0648\u0627", "202": "\u0648\u0631", "203": "\u2581\u0623\u0646", "204": "\u2581\u0644\u0644", "205": "\u064a\u062f", "206": "\u0647\u0645", "207": "\u2581\u0627\u0644\u0633", "208": "\u064a\u0627", "209": "\u2581\u0627\u0644\u062d", "210": "\u2581\u0627\u0644\u0627", "211": "\u2581\u0627\u0646", "212": "\u0639\u062f", "213": "\u2581\u0627\u0644\u0642", "214": "\u0627\u0626", "215": "\u2581\u0628\u0627\u0644", "216": "\u2581\u0627\u0644\u0634", "217": "\u2581\u0639\u0646", "218": "\u0644\u0643", "219": "\u2581\u0627\u0644\u062c", "220": "\u2581\u0627\u0644\u062f", "221": "\u2581\u0627\u0644\u0628", "222": "\u0627\u0621", "223": "\u0648\u0645", "224": "\u064a\u0644", "225": "\u0631\u0628", "226": "\u0627\u0641", "227": "\u2581\u0645\u0639", "228": "\u0648\u062f", "229": "\u0631\u0629", "230": "\u0645\u0646", "231": "\u2581\u0627\u0644\u0641", "232": "\u0630\u0627", "233": "\u0642\u062f", "234": "\u062d\u062f", "235": "\u0639\u0629", "236": "\u0631\u0643", "237": "\u2581\u0627\u0644\u0646", "238": "\u2581\u0625\u0644\u0649", "239": "\u2581\u0648\u062a", "240": "\u0645\u0629", "241": "\u064a\u0633", "242": "\u0642\u0629", "243": "\u0645\u0644", "244": "\u2581\u0627\u0644\u062a\u064a", "245": "\u0628\u064a", "246": "\u0627\u0639", "247": "\u2581\u0627\u0644\u0625", "248": "\u2581\u0627\u0644\u0643", "249": "\u2581\u0627\u0644\u0644", "250": "\u0645\u062f", "251": "\u2581\u0648\u0623", "252": "\u0648\u0642", "253": "\u2581\u0627\u0644\u062e", "254": "\u064a\u062a", "255": "\u2581\u0627\u0644\u0630", "256": "\u0633\u0628", "257": "\u0644\u0645", "258": "\u2581\u0645\u0627", "259": "\u064a\u0645", "260": "\u2581\u0644\u0627", "261": "\u0641\u064a", "262": "\u0631\u0648", "263": "\u0628\u062f", "264": "\u0628\u0644", "265": "\u0628\u0631", "266": "\u2581\u0627\u0644\u0635", "267": "\u2581\u0628\u0646", "268": "\u0644\u0629", "269": "\u0627\u0631\u0629", "270": "\u0645\u0631", "271": "\u2581\u0627\u0644\u0648", "272": "\u2581\u0648\u0627", "273": "\u2581\u0645\u062d", "274": "\u2581\u0627\u0644\u0631", "275": "\u0646\u064a", "276": "\u0642\u064a", "277": "\u062d\u062a", "278": "\u0647\u062f", "279": "\u0639\u0644", "280": "\u0630\u0647", "281": "\u064a\u0639", "282": "\u0645\u0639", "283": "\u062c\u0644", "284": "\u2581\u0643\u0627\u0646", "285": "\u2581\u0648\u0642", "286": "\u062a\u0647", "287": "\u2581\u0639\u0644\u064a", "288": "\u0645\u0648", "289": "\u0643\u0646", "290": "\u0633\u064a", "291": "\u0631\u0641", "292": "\u0628\u0627", "293": "\u2581\u0627\u0644\u0649", "294": "\u2581\u0627\u0644\u0630\u064a", "295": "\u2581\u0623\u0648", "296": "\u2581\u0644\u0645", "297": "\u0644\u0627\u0644", "298": "\u062a\u064a", "299": "\u0627\u0646\u064a", "300": "\u062f\u064a", "301": "\u0643\u0631", "302": "\u0633\u0645", "303": "\u2581\u0627\u0644\u0637", "304": "\u062e\u0631", "305": "\u2581\u0627\u0644\u0645\u062a", "306": "\u2581\u0647\u0630\u0627", "307": "\u2581\u0648\u0647", "308": "\u064a\u0627\u062a", "309": "\u0633\u0627", "310": "\u0627\u0636", "311": "\u0635\u0644", "312": "\u0643\u0644", "313": "\u0639\u062a", "314": "\u2581\u0627\u0644\u062b", "315": "\u064a\u0641", "316": "\u062d\u0629", "317": "\u2581\u0643\u0644", "318": "\u0639\u0628", "319": "\u2581\u0627\u0633\u062a", "320": "\u0627\u0635", "321": "\u2581\u0628\u064a\u0646", "322": "\u0623\u0646", "323": "\u0626\u064a\u0633", "324": "\u2581\u0639\u0628\u062f", "325": "\u2581\u064a\u062a", "326": "\u2581\u0648\u0645", "327": "\u2581\u0628\u0639\u062f", "328": "\u0633\u0629", "329": "\u2581\u0647\u0630\u0647", "330": "\u0646\u0629", "331": "\u0646\u062a", "332": "\u0644\u0641", "333": "\u2581\u0627\u0644\u0644\u0647", "334": "\u0642\u062a", "335": "\u0631\u0636", "336": "\u0643\u062a", "337": "\u0647\u0631", "338": "\u062f\u0645", "339": "\u062c\u0647", "340": "\u0628\u0629", "341": "\u0633\u0644", "342": "\u0634\u0627\u0631", "343": "\u0632\u064a", "344": "\u2581\u0623\u0645", "345": "\u0639\u0627", "346": "\u062f\u0627", "347": "\u0645\u0627\u0644", "348": "\u0643\u0627\u0646", "349": "\u0648\u064a", "350": "\u0643\u0648\u0646", "351": "\u2581\u0645\u062a", "352": "\u0648\u0641", "353": "\u0631\u062a", "354": "\u064a\u0631\u0629", "355": "\u0648\u0644\u0629", "356": "\u2581\u0625\u0646", "357": "\u0648\u0633", "358": "\u2581\u0648\u0628", "359": "\u0627\u062f\u0629", "360": "\u062c\u0627", "361": "\u0627\u0644\u0645", "362": "\u0635\u0631", "363": "\u2581\u0645\u062f", "364": "\u2581\u0627\u0644\u0639\u0627\u0645", "365": "\u0642\u0627", "366": "\u2581\u0648\u0627\u0644\u0645", "367": "\u0637\u0629", "368": "\u0631\u0627\u0621", "369": "\u0628\u0627\u0631", "370": "\u0628\u0646", "371": "\u258120", "372": "\u2581\u0639\u0627\u0645", "373": "\u2581\u062e\u0644\u0627\u0644", "374": "\u0639\u0636", "375": "\u062f\u064a\u062f", "376": "\u0634\u0631", "377": "\u064a\u062b", "378": "\u0631\u064a\u0642", "379": "\u2581\u062a\u0639", "380": "\u0648\u0628", "381": "\u0641\u0627", "382": "\u062e\u062a", "383": "\u2581\u0647\u0648", "384": "\u062c\u062a", "385": "\u0648\u0636", "386": "\u2581\u0644\u062a", "387": "\u062f\u0631", "388": "\u0642\u0644", "389": "\u062f\u0629", "390": "\u2581\u0627\u0644\u064a", "391": "\u0648\u062c", "392": "\u2581\u0648\u0639", "393": "\u0627\u0644\u064a", "394": "\u062e\u0644", "395": "\u0637\u0644", "396": "\u2581\u0623\u064a", "397": "\u2581\u0648\u0627\u0644\u062a", "398": "\u0627\u0646\u064a\u0629", "399": "\u062b\u0631", "400": "\u2581\u0645\u0634", "401": "\u0627\u0631\u064a", "402": "\u0631\u062d", "403": "\u0627\u0631\u0627\u062a", "404": "\u0644\u0647", "405": "\u0631\u0643\u0629", "406": "\u0648\u0632", "407": "\u0648\u0639", "408": "\u2581\u0648\u064a", "409": "\u2581\u062a\u0645", "410": "\u0648\u0631\u0629", "411": "\u2581\u0648\u0633", "412": "\u2581\u0628\u0644", "413": "\u2581\u0630\u0644\u0643", "414": "\u0637\u0646", "415": "\u2581\u0639\u0628\u062f\u0627\u0644", "416": "\u2581\u062a\u062d", "417": "\u2581\u0645\u062d\u0645\u062f", "418": "\u0631\u0642", "419": "\u062e\u0635", "420": "\u0627\u062d", "421": "\u0646\u062f", "422": "\u2581\u0645\u0633", "423": "\u2581\u0643\u0645\u0627", "424": "\u2581\u0627\u0644\u0645\u062d", "425": "\u2581\u0641\u0649", "426": "\u2581\u0627\u0644\u0645\u0646", "427": "\u0641\u0633", "428": "\u0642\u0631", "429": "\u062c\u0644\u0633", "430": "\u0643\u0645", "431": "\u062f\u062f", "432": "\u2581\u0642\u0627\u0644", "433": "\u2581\u0644\u0647", "434": "\u0626\u0629", "435": "\u2581\u0627\u0644\u0623\u0645", "436": "\u2581\u0648\u0642\u0627\u0644", "437": "\u0627\u062f\u064a", "438": "\u2581\u064a\u0639", "439": "\u2581\u0648\u0644", "440": "\u0648\u0627\u062a", "441": "\u0641\u062a", "442": "\u2581\u062d\u064a\u062b", "443": "\u2581\u0627\u0644\u0627\u0646", "444": "\u2581\u062a\u062a", "445": "\u0627\u062c", "446": "\u0641\u0631", "447": "\u0648\u0649", "448": "\u0630\u0644\u0643", "449": "\u0627\u0641\u0629", "450": "\u2581\u0628\u0645", "451": "\u2581\u0648\u0632", "452": "\u062b\u0644", "453": "\u2581\u0628\u062a", "454": "\u2581\u0627\u0644\u063a", "455": "\u0648\u0631\u064a", "456": "\u258119", "457": "\u2581\u0631\u0626\u064a\u0633", "458": "\u0633\u064a\u0629", "459": "\u2581\u0627\u0644\u0647", "460": "\u2581\u0648\u062c", "461": "\u062a\u0647\u0627", "462": "\u2581\u0627\u0644\u0645\u0639", "463": "\u2581\u0623\u0643", "464": "\u2581\u0647\u064a", "465": "\u2581\u0627\u0644\u0639\u0631\u0628", "466": "\u2581\u0645\u0633\u062a", "467": "\u0648\u064a\u0629", "468": "\u2581\u0627\u0644\u0645\u062f", "469": "\u2581\u0648\u0644\u0627", "470": "\u2581\u0628\u062f", "471": "\u0648\u062a", "472": "\u2581\u0642\u0628\u0644", "473": "\u0627\u0644\u0629", "474": "\u0644\u064a\u0645", "475": "\u0639\u0648\u062f", "476": "\u0648\u064a\u062a", "477": "\u2581\u0627\u0644\u0645\u0633\u062a", "478": "\u2581\u0648\u0625", "479": "\u2581\u0645\u062c", "480": "\u2581\u0642\u062f", "481": "\u0643\u064a", "482": "\u062a\u0649", "483": "\u2581\u0644\u0644\u0645", "484": "\u2581\u0627\u0644\u0627\u0633\u062a", "485": "\u2581\u0627\u0644\u0645\u0633", "486": "\u0639\u064a", "487": "\u2581\u0648\u0646", "488": "\u2581\u0623\u0628", "489": "\u0631\u062c", "490": "\u0636\u0627", "491": "\u062d\u062f\u0629", "492": "\u2581\u0648\u0645\u0646", "493": "\u0637\u0642\u0629", "494": "\u2581\u0633\u064a", "495": "\u062d\u064a", "496": "\u0639\u0645", "497": "\u0643\u0648\u0645", "498": "\u0628\u062a", "499": "\u064a\u0646\u0629", "500": "\u2581\u0628\u0647", "501": "\u2581\u0648\u0641\u064a", "502": "\u2581\u062a\u0646", "503": "\u064a\u0632", "504": "\u0633\u0628\u0629", "505": "\u2581\u0648\u062d", "506": "\u2581\u063a\u064a\u0631", "507": "\u2581\u0628\u0627", "508": "\u2581\u0628\u062d", "509": "\u2581\u0627\u0644\u0632", "510": "\u2581\u064a\u0642", "511": "\u0627\u0644\u064a\u0629", "512": "\u2581\u0648\u0643", "513": "\u0648\u0627\u0646", "514": "\u2581\u0627\u0644\u0639\u0627\u0644\u0645", "515": "\u2581\u0639\u0644\u064a\u0647", "516": "\u2581\u0628\u0631", "517": "\u0623\u0633", "518": "\u0644\u0628", "519": "\u2581\u0639\u0646\u062f", "520": "\u0646\u0627\u0621", "521": "\u0631\u0627\u0626", "522": "\u2581\u0627\u0644\u062f\u0648\u0644", "523": "\u2581\u0627\u0644\u0622", "524": "\u0641\u0629", "525": "\u0645\u064a\u0639", "526": "\u064a\u0631\u0627", "527": "\u2581\u062d\u062a\u0649", "528": "\u2581\u0628\u0639\u0636", "529": "\u064a\u0628", "530": "\u2581\u062a\u0642", "531": "\u0648\u0629", "532": "\u2581\u0627\u0645", "533": "\u062a\u062e", "534": "\u062d\u0645\u062f", "535": "\u2581\u0645\u0624", "536": "\u2581\u064a\u0645", "537": "\u2581\u0627\u0644\u0627\u0645", "538": "\u2581\u0627\u0644\u0645\u0634", "539": "\u0641\u0636", "540": "\u2581\u0628\u0634", "541": "\u0641\u0639", "542": "\u0645\u0627\u0639", "543": "\u2581\u0648\u0642\u062f", "544": "\u0642\u0628\u0644", "545": "\u2581\u0648\u0647\u0648", "546": "\u0643\u0629", "547": "\u2581200", "548": "\u2581\u0627\u0644\u0646\u0627", "549": "\u2581\u0644\u064a", "550": "\u2581\u0627\u0644\u0627\u062a", "551": "\u0642\u0637", "552": "\u062d\u0627", "553": "\u2581\u0643\u0627\u0646\u062a", "554": "\u0642\u0627\u062a", "555": "\u0648\u0627\u0631", "556": "\u0646\u064a\u0629", "557": "\u2581\u0623\u0633", "558": "\u0631\u0643\u0632", "559": "\u0631\u064a\u0627\u0636", "560": "\u2581\u0633\u062a", "561": "\u2581\u062a\u0634", "562": "\u0635\u0628", "563": "\u062b\u0629", "564": "\u0642\u0628", "565": "\u0635\u0627\u062f", "566": "\u0633\u0637", "567": "\u2581\u0623\u0646\u0647", "568": "\u0631\u062f", "569": "\u0633\u0646", "570": "\u2581\u0647\u0646\u0627", "571": "\u2581\u062b\u0645", "572": "\u0642\u062f\u0645", "573": "\u0648\u0643", "574": "\u0632\u0629", "575": "\u0648\u0644\u0627", "576": "\u2581\u0627\u0644\u064a\u0648\u0645", "577": "\u0627\u0637", "578": "\u064a\u0634", "579": "\u2581\u0627\u0644\u0628\u0644", "580": "\u062c\u062f", "581": "\u0628\u0647", "582": "\u0627\u0635\u0629", "583": "\u062d\u0648", "584": "\u0633\u0644\u0627\u0645", "585": "\u062e\u0631\u0649", "586": "\u2581\u0648\u0643\u0627\u0646", "587": "\u0627\u0645\u0644", "588": "\u2581\u0639\u062f\u062f", "589": "\u0635\u0641", "590": "\u062d\u0627\u062f", "591": "\u0642\u064a\u0642", "592": "\u2581\u0627\u0644\u0639\u0645\u0644", "593": "\u2581\u0628\u0623\u0646", "594": "\u0631\u0627\u062a", "595": "\u0644\u0627\u0645", "596": "\u0627\u0628\u0629", "597": "\u2581\u0643\u0628", "598": "\u2581\u0648\u0641", "599": "\u0625\u0646", "600": "\u062f\u0627\u0631\u0629", "601": "\u2581\u0644\u0644\u062a", "602": "\u062c\u0645", "603": "\u2581\u0645\u062c\u0644\u0633", "604": "\u2581\u0627\u0644\u0645\u0624", "605": "\u0636\u0639", "606": "\u2581\u0641\u064a\u0647\u0627", "607": "\u0627\u0647", "608": "\u062c\u0629", "609": "\u064a\u064a\u0646", "610": "\u0631\u0645", "611": "\u2581\u0627\u0644\u0631\u0626\u064a\u0633", "612": "\u064a\u0627\u0646", "613": "\u062a\u0645", "614": "\u0633\u0627\u062a", "615": "\u2581\u0645\u0644\u064a", "616": "\u0643\u062f", "617": "\u0631\u0646", "618": "\u0636\u0627\u0641", "619": "\u2581\u0627\u0644\u0645\u0635", "620": "\u0631\u064a\u0629", "621": "\u2581\u0627\u0644\u0631\u064a\u0627\u0636", "622": "\u2581\u0627\u0644\u0633\u064a\u0627", "623": "\u0627\u0629", "624": "\u2581\u0639\u0645\u0644", "625": "\u0628\u0627\u062a", "626": "\u2581\u0627\u0644\u0643\u0648\u064a\u062a", "627": "\u2581\u0641\u064a\u0647", "628": "\u0648\u0627\u0642", "629": "\u0632\u064a\u0632", "630": "\u2581\u0644\u0643\u0646", "631": "\u2581\u062f\u0648\u0644", "632": "\u2581\u064a\u0648\u0645", "633": "\u0639\u064a\u062f", "634": "\u0641\u0627\u0639", "635": "\u2581\u0627\u0644\u0648\u0632", "636": "\u0644\u062a", "637": "\u2581\u0648\u0627\u0644\u0623", "638": "\u2581\u0627\u0644\u0623\u0648\u0644", "639": "\u0627\u0632", "640": "\u0628\u064a\u0629", "641": "\u2581\u0627\u062a", "642": "\u2581\u0627\u0644\u062d\u0643\u0648\u0645", "643": "\u0628\u0639", "644": "\u064a\u062c", "645": "\u0631\u0627\u0642", "646": "\u2581\u0623\u0639", "647": "\u0635\u062f", "648": "\u062b\u064a\u0631", "649": "\u0635\u0629", "650": "\u0647\u0645\u0627", "651": "\u0627\u0631\u062c", "652": "\u064a\u062e", "653": "\u0627\u0631\u064a\u0629", "654": "\u2581\u064a\u062c", "655": "\u2581\u0627\u0644\u0645\u0645", "656": "\u2581\u0644\u0623\u0646", "657": "\u2581\u0627\u0644\u0645\u0627\u0636", "658": "\u2581\u0648\u0627\u0646", "659": "\u063a\u064a\u0631", "660": "\u2581\u0644\u0623", "661": "\u0627\u0644\u0627\u062a", "662": "\u0631\u0648\u0639", "663": "\u0627\u0641\u0638", "664": "\u2581\u0639\u0645", "665": "\u0637\u0627\u0639", "666": "\u2581\u0628\u0647\u0627", "667": "\u0648\u0644\u0649", "668": "\u2581\u064a\u0646", "669": "\u064a\u0647", "670": "\u062c\u0646\u0629", "671": "\u2581\u0641\u062a", "672": "\u0642\u0627\u0621", "673": "\u2581\u064a\u062d", "674": "\u2581\u062a\u0623", "675": "\u2581\u0648\u0644\u0643", "676": "\u2581\u0646\u0638", "677": "\u2581\u0645\u0635", "678": "\u0647\u0644", "679": "\u0648\u0635", "680": "\u2581\u0627\u0644\u0636", "681": "\u0648\u0642\u0639", "682": "\u2581\u0627\u0644\u0645\u0646\u0627", "683": "\u2581\u0627\u0644\u0633\u0639\u0648\u062f", "684": "\u2581\u064a\u0643\u0648\u0646", "685": "\u062f\u064a\u062f\u0629", "686": "\u2581\u0627\u0644\u0639\u0631\u0628\u064a\u0629", "687": "\u062e\u062a\u0644\u0641", "688": "\u2581\u0645\u062b\u0644", "689": "\u2581\u0646\u0641\u0633", "690": "00", "691": "\u2581\u0644\u062f", "692": "\u0627\u0626\u0644", "693": "\u2581\u0647\u0646\u0627\u0643", "694": "\u2581\u062a\u0633", "695": "\u2581\u0648\u0634", "696": "\u2581\u0628\u0623", "697": "\u0627\u0645\u062c", "698": "\u064a\u0646\u0627", "699": "\u2581\u0645\u0642", "700": "\u064a\u0648", "701": "\u2581\u062e\u0637", "702": "\u062b\u0645", "703": "\u2581\u0627\u0644\u062a\u0639", "704": "\u2581\u062a\u0635", "705": "\u0645\u0647", "706": "\u0644\u0627\u062d", "707": "\u0637\u0627\u0644", "708": "\u0648\u0631\u064a\u0629", "709": "\u064a\u0644\u0629", "710": "\u0643\u064a\u0629", "711": "\u062c\u062a\u0645\u0627\u0639", "712": "\u2581\u062a\u062c", "713": "\u2581\u0627\u0644\u0623\u0633", "714": "\u062d\u062f\u062b", "715": "\u0627\u062e\u0644", "716": "\u0633\u0631\u0627\u0626", "717": "\u2581\u0625\u0644\u0627", "718": "\u2581\u0648\u0644\u0643\u0646", "719": "\u2581\u0625\u0644\u064a", "720": "\u2581\u0627\u0644\u0645\u062c", "721": "\u2581\u0633\u0646", "722": "\u0624\u0648\u0644", "723": "\u0627\u0646\u0648\u0646", "724": "\u0627\u0645\u0629", "725": "\u2581\u0639\u0628\u062f\u0627\u0644\u0644\u0647", "726": "\u0641\u0644", "727": "\u2581\u0627\u0644\u062a\u0646", "728": "\u2581\u062c\u0645\u064a\u0639", "729": "\u2581\u0645\u0648", "730": "\u0633\u064a\u0646", "731": "\u2581\u0648\u0627\u0644\u0639", "732": "\u062e\u0637", "733": "\u0631\u0627\u0641", "734": "\u0631\u0649", "735": "\u2581\u0644\u0647\u0627", "736": "\u2581\u062d\u062f", "737": "\u2581\u0644\u0646", "738": "\u2581\u0628\u0627\u0644\u0645", "739": "\u2581\u0627\u0639\u062a", "740": "\u2581\u0648\u062f", "741": "\u0628\u0631\u0627", "742": "\u062c\u062a\u0645\u0639", "743": "\u2581\u0627\u0644\u0630\u064a\u0646", "744": "\u2581\u0627\u0644\u0645\u0631", "745": "\u2581\u062a\u062f", "746": "\u2581\u0623\u0643\u062b\u0631", "747": "\u2581\u0643\u062a", "748": "\u0631\u0643\u0627\u062a", "749": "\u2581\u0623\u0628\u0648", "750": "\u0648\u064a\u0631", "751": "\u0643\u0627", "752": "\u2581\u0648\u0631", "753": "\u0627\u0628\u0627\u062a", "754": "\u2581\u0627\u0644\u0645\u062a\u062d\u062f\u0629", "755": "\u062d\u0631", "756": "\u0627\u0631\u064a\u062e", "757": "\u0631\u0627\u062c", "758": "\u2581\u0645\u0646\u0630", "759": "\u2581\u0641\u0625\u0646", "760": "\u2581201", "761": "\u2581\u0648\u0627\u0644\u0627", "762": "\u2581\u0623\u062d\u062f", "763": "\u2581\u0627\u0646\u062a", "764": "\u0639\u064a\u0629", "765": "\u2581\u0633\u0628", "766": "\u0642\u0649", "767": "\u0627\u0644\u062d", "768": "\u0634\u0641", "769": "\u0635\u0648\u0644", "770": "\u0638\u0631", "771": "\u2581\u064a\u0633\u062a", "772": "\u2581\u0627\u0646\u0647", "773": "\u0627\u0631\u0633", "774": "\u2581\u0627\u0644\u0645\u0648\u0627", "775": "\u2581\u062d\u0642", "776": "\u2581\u062a\u062d\u062a", "777": "\u0631\u0627\u0631", "778": "\u2581\u062d\u0648\u0644", "779": "\u2581\u0628\u0627\u0644\u062a", "780": "\u2581\u0627\u0644\u0645\u0648", "781": "\u2581\u0648\u0647\u064a", "782": "\u2581\u062f\u0648\u0646", "783": "\u0644\u0643\u0629", "784": "\u2581\u064a\u0627", "785": "\u2581\u0623\u0645\u0633", "786": "\u0648\u0627\u0621", "787": "\u0627\u0646\u0628", "788": "\u2581\u064a\u0645\u0643\u0646", "789": "\u0628\u0627\u0628", "790": "\u2581\u0627\u064a", "791": "\u2581\u0627\u0644\u0644\u0627", "792": "\u064a\u0646\u064a", "793": "\u2581\u0625\u0630\u0627", "794": "\u0643\u0631\u0629", "795": "\u0633\u0628\u0628", "796": "\u0630\u0643\u0631", "797": "\u2581\u0644\u062d", "798": "\u2581\u0641\u0631", "799": "\u2581\u064a\u062f", "800": "\u2581\u0627\u0648", "801": "\u2581\u062a\u0637", "802": "\u0628\u0644\u063a", "803": "\u0642\u0648\u0644", "804": "\u062d\u064a\u0629", "805": "\u0633\u0627\u0646", "806": "\u2581\u0645\u0646\u0647\u0627", "807": "\u0644\u0627\u0621", "808": "\u0639\u0627\u062a", "809": "\u0648\u0637", "810": "\u2581\u0627\u0644\u062a\u062c", "811": "\u2581\u062a\u0644\u0643", "812": "\u0631\u064a\u062f", "813": "\u2581\u0627\u0644\u0633\u0627\u0628", "814": "\u063a\u0645", "815": "\u0634\u062a", "816": "\u0638\u0645", "817": "\u2581\u0627\u0644\u0639\u0627\u0645\u0629", "818": "\u2581\u0627\u0644\u0648\u0642", "819": "\u2581\u0628\u0637", "820": "\u2581\u0645\u0631", "821": "\u0639\u0644\u0627\u0645", "822": "\u0636\u0645", "823": "\u0648\u0627\u0626", "824": "\u0637\u0641", "825": "\u2581\u0627\u0644\u0645\u0644\u0643", "826": "\u2581\u0648\u0630\u0644\u0643", "827": "\u0642\u062a\u0635\u0627\u062f", "828": "\u0631\u0628\u064a\u0629", "829": "\u2581\u0645\u0628\u0627\u0631", "830": "\u2581\u0627\u0644\u0634\u064a\u062e", "831": "\u2581\u0622\u062e\u0631", "832": "\u2581\u0627\u0644\u0631\u0627", "833": "\u2581\u0648\u0623\u0646", "834": "\u2581\u0627\u0644\u0648\u0637\u0646", "835": "\u0644\u064a\u0644", "836": "\u0630\u064a", "837": "\u0646\u0649", "838": "\u0627\u0642", "839": "\u2581\u064a\u062a\u0645", "840": "\u0633\u0631", "841": "\u0644\u0627\u0642", "842": "\u0647\u062f\u0641", "843": "\u0636\u064a", "844": "\u2581\u0627\u0644\u0623\u0645\u064a\u0631", "845": "\u0633\u0627\u0639\u062f", "846": "\u0627\u0644\u062a", "847": "\u0645\u0648\u0639\u0629", "848": "\u2581\u0648\u0644\u064a", "849": "\u0628\u0637", "850": "\u0641\u0636\u0644", "851": "\u0644\u0627\u0641", "852": "\u0643\u062a\u0648\u0631", "853": "\u0645\u0627\u0621", "854": "\u0639\u0632\u064a\u0632", "855": "\u0627\u0645\u0639\u0629", "856": "\u062f\u064a\u0629", "857": "\u0627\u0634", "858": "\u2581\u0623\u0648\u0644", "859": "\u2581\u0627\u0644\u0645\u0646\u062a", "860": "\u2581\u0623\u062f", "861": "\u0636\u0631", "862": "\u0636\u0627\u0641\u0629", "863": "\u0627\u062a\u0647", "864": "\u2581\u0644\u0628\u0646", "865": "\u2581\u0645\u0645", "866": "\u0639\u0627\u0648\u0646", "867": "\u2581\u0628\u0634\u0643\u0644", "868": "\u062e\u062f", "869": "\u2581\u0627\u0628\u0646", "870": "\u064a\u0631\u064a", "871": "\u2581\u0627\u0644\u0645\u0627\u0636\u064a", "872": "\u2581\u0644\u0644\u0627", "873": "\u0639\u0631", "874": "\u2581\u0627\u0644\u062d\u0643\u0648\u0645\u0629", "875": "\u0644\u0633\u0637", "876": "\u0641\u0627\u0642", "877": "\u2581\u0639\u0644\u064a\u0647\u0627", "878": "\u0637\u0631", "879": "\u064a\u0626\u0629", "880": "\u0639\u062f\u0627\u062f", "881": "\u2581\u0627\u0644\u0627\u062a\u062d\u0627\u062f", "882": "\u2581\u0648\u0627\u0644\u062a\u064a", "883": "\u0644\u064a\u0629", "884": "\u2581\u0648\u0627\u0644\u062f", "885": "\u2581\u0627\u062d\u062a", "886": "\u0648\u062f\u0629", "887": "\u2581\u0627\u0644\u062f\u0648\u0644\u0629", "888": "\u2581\u0634\u064a", "889": "\u2581\u0645\u0648\u0627", "890": "\u2581\u0627\u0644\u062a\u062d", "891": "\u0639\u0645\u0627\u0644", "892": "\u2581\u0627\u0644\u062c\u0632", "893": "\u2581\u0627\u0644\u0641\u0631\u064a\u0642", "894": "\u2581\u0644\u0648", "895": "\u062c\u0631", "896": "\u2581\u0628\u0625", "897": "\u0635\u062d", "898": "\u0626\u0627", "899": "\u2581\u0623\u064a\u0636\u0627", "900": "\u0644\u0627\u062b", "901": "\u0644\u0637", "902": "\u2581\u0645\u0646\u0637\u0642\u0629", "903": "\u2581\u062d\u0627\u0644", "904": "\u2581\u0627\u0644\u0625\u0646", "905": "\u0637\u0646\u064a", "906": "\u2581\u0645\u0644\u064a\u0648\u0646", "907": "\u0642\u0627\u0644", "908": "\u2581\u0627\u0644\u0623\u062e", "909": "\u0627\u0631\u062a", "910": "\u2581\u0627\u0644\u0639\u0645", "911": "\u2581\u0641\u064a\u0645\u0627", "912": "\u0632\u0645", "913": "\u0637\u0627\u0631", "914": "\u2581\u0644\u0627\u0639", "915": "\u2581\u062c\u0647", "916": "\u2581\u0648\u0645\u0627", "917": "\u2581\u0645\u0645\u0627", "918": "\u2581\u0648\u0632\u064a\u0631", "919": "\u0627\u0644\u062f", "920": "\u2581\u0627\u0644\u0645\u0642\u0628\u0644", "921": "\u2581\u0628\u0639", "922": "\u2581\u0648\u0627\u0633\u062a", "923": "\u2581\u0623\u062d\u0645\u062f", "924": "\u2581\u0623\u0634", "925": "\u2581\u0627\u0644\u062c\u0646", "926": "\u064a\u0637", "927": "\u0623\u0629", "928": "\u0631\u064a\u0628", "929": "\u2581\u0627\u0644\u0645\u0646\u0637\u0642\u0629", "930": "\u0632\u0628", "931": "\u2581\u064a\u0634", "932": "\u0644\u0642", "933": "\u2581\u0645\u0635\u0631", "934": "\u062e\u062f\u0645", "935": "\u0628\u0627\u062f", "936": "\u2581\u062c\u0646", "937": "\u2581\u0648\u0632\u0627\u0631\u0629", "938": "\u0627\u0626\u064a\u0629", "939": "\u2581\u0634\u0631\u0643\u0629", "940": "\u062f\u064a\u062b", "941": "\u2581\u0627\u0644\u0625\u0645", "942": "\u2581\u062a\u0643\u0648\u0646", "943": "\u2581\u0633\u0646\u0629", "944": "\u0633\u0627\u0621", "945": "\u064a\u062f\u0629", "946": "\u2581\u0627\u0644\u0645\u0634\u0627\u0631", "947": "\u2581\u0644\u064a\u0633", "948": "\u0641\u0642", "949": "\u0643\u0633", "950": "\u0643\u0631\u064a", "951": "\u2581\u0644\u0625", "952": "\u0627\u0633", "953": "\u2581\u0641\u0642\u062f", "954": "\u2581\u0627\u0644\u0645\u0645\u0644\u0643\u0629", "955": "\u062d\u062b", "956": "\u064a\u0631\u0627\u0646", "957": "\u2581\u0644\u0628\u0646\u0627\u0646", "958": "\u0636\u0629", "959": "\u062c\u0646", "960": "\u0643\u062b\u0631", "961": "\u2581\u0627\u0644\u062b\u0627\u0646\u064a", "962": "\u0645\u064a\u0629", "963": "\u0648\u0642\u0641", "964": "\u0639\u0627\u0631", "965": "\u2581\u0627\u0644\u062f\u0643\u062a\u0648\u0631", "966": "\u0632\u0644", "967": "\u0644\u064a\u0627\u062a", "968": "\u0648\u0627\u0628", "969": "\u2581\u0627\u0644\u0645\u0628\u0627\u0631", "970": "\u2581\u0627\u0644\u0634\u0631", "971": "\u062e\u0630", "972": "\u0633\u0631\u0627\u0626\u064a\u0644", "973": "\u2581\u0623\u0645\u0627\u0645", "974": "\u064a\u0646\u064a\u0629", "975": "\u2581\u0632\u064a", "976": "\u0627\u0645\u0627", "977": "\u0627\u0630", "978": "\u2581\u0642\u064a", "979": "\u2581\u0627\u0644\u0623\u0645\u0646", "980": "\u2581\u062d\u064a\u0646", "981": "\u2581\u0645\u062f\u064a\u0631", "982": "\u258114", "983": "\u0627\u0641\u0638\u0629", "984": "\u2581\u064a\u0633", "985": "\u2581\u0648\u0644\u0645", "986": "\u2581\u0641\u0647", "987": "\u2581\u0627\u0644\u0641\u062a", "988": "\u2581\u062e\u0627\u0635\u0629", "989": "\u2581\u0646\u0642", "990": "\u2581\u062a\u0633\u062a", "991": "\u2581\u0634\u062e\u0635", "992": "\u2581\u0646\u062d\u0648", "993": "\u062d\u0646", "994": "\u0648\u0647", "995": "\u2581\u0627\u0631\u062a", "996": "\u2581\u062a\u0641", "997": "\u2581\u0623\u062e\u0631\u0649", "998": "\u0648\u062d", "999": "\u2581\u0639\u0628\u062f\u0627\u0644\u0639\u0632\u064a\u0632", "1000": "\u2581\u0648\u0635", "1001": "\u2581\u0628\u0645\u0627", "1002": "\u0648\u0644\u0627\u064a\u0627\u062a", "1003": "\u0631\u064a\u0641", "1004": "\u064a\u0644\u064a", "1005": "\u2581\u0648\u0627\u0644\u0625", "1006": "\u0631\u0628\u0639", "1007": "\u2581\u0648\u062e", "1008": "\u064a\u0627\u0644", "1009": "\u2581\u0627\u0644\u0645\u062c\u0644\u0633", "1010": "\u0648\u0631\u0648", "1011": "\u0638\u0645\u0629", "1012": "\u2581\u0627\u0633", "1013": "\u062c\u0631\u0627\u0621", "1014": "\u0641\u064a\u0630", "1015": "\u0627\u062d\u0628", "1016": "\u2581\u0639\u062f\u0645", "1017": "\u2581\u0639\u0646\u062f\u0645\u0627", "1018": "\u063a\u0629", "1019": "\u0634\u0631\u0629", "1020": "\u0631\u0627\u0643", "1021": "\u2581\u0627\u0644\u0648\u0642\u062a", "1022": "\u0638\u0627\u0645", "1023": "\u2581\u0627\u0644\u0648\u0637\u0646\u064a", "1024": "\u2581\u0648\u0627\u0644\u062d", "1025": "\u0645\u064a", "1026": "\u2581\u0627\u0644\u0639\u0642", "1027": "\u2581\u0627\u0644\u0625\u0633\u0644\u0627\u0645", "1028": "\u0635\u0628\u062d", "1029": "\u2581\u0627\u0644\u0623\u0648\u0644\u0649", "1030": "\u0631\u0641\u0629", "1031": "\u2581\u0628\u064a", "1032": "\u2581\u0639\u0628\u0631", "1033": "\u0646\u0627\u0626", "1034": "\u2581\u0646\u062a", "1035": "\u2581\u0648\u0627\u0644\u0646", "1036": "\u0644\u064a\u062c", "1037": "\u2581\u0627\u0644\u0644\u0628\u0646", "1038": "\u2581\u0627\u0644\u0633\u0639\u0648\u062f\u064a\u0629", "1039": "\u0637\u064a", "1040": "\u063a\u064a", "1041": "\u2581\u0644\u0644\u0623", "1042": "\u258110", "1043": "\u2581\u0645\u0646\u0647", "1044": "\u064a\u0641\u0629", "1045": "\u0632\u064a\u062f", "1046": "\u0638\u064a\u0645", "1047": "\u2581\u0628\u0633\u0628\u0628", "1048": "\u2581\u0641\u0642\u0637", "1049": "\u064a\u0627\u0629", "1050": "\u2581\u0623\u0645\u0627", "1051": "\u0627\u0646\u064a\u0627", "1052": "\u0645\u062a", "1053": "\u2581\u0628\u062c", "1054": "\u2581\u0627\u0644\u0645\u062c\u062a\u0645\u0639", "1055": "\u0642\u062f\u064a\u0645", "1056": "\u0648\u0646\u064a", "1057": "\u2581\u062f\u0648\u0644\u0627\u0631", "1058": "\u0632\u0645\u0629", "1059": "\u2581\u0627\u0644\u062e\u0627\u0631\u062c", "1060": "\u2581\u0645\u062f\u064a\u0646\u0629", "1061": "\u2581\u062f\u0648\u0631", "1062": "\u2581\u0633\u064a\u0627", "1063": "\u2581\u0627\u0644\u0635\u062d", "1064": "\u2581\u0642\u0627\u0626", "1065": "\u0627\u0626\u0631", "1066": "\u0642\u064a\u0642\u0629", "1067": "\u2581\u0642\u0627\u0645", "1068": "\u2581\u0631\u0633", "1069": "\u2581\u0643\u062b", "1070": "\u2581\u0642\u062f\u0645", "1071": "\u2581\u0646\u0647\u0627", "1072": "\u2581\u0645\u062e\u062a\u0644\u0641", "1073": "\u0632\u0627", "1074": "\u2581\u0648\u0623\u0636\u0627\u0641", "1075": "\u0627\u0628\u0639\u0629", "1076": "\u2581\u0644\u0645\u0627", "1077": "\u0648\u0645\u0627\u062a", "1078": "\u0643\u0645\u0629", "1079": "\u0643\u062a\u0628", "1080": "\u2581\u0628\u0644\u063a", "1081": "\u2581\u0648\u062c\u0648\u062f", "1082": "\u2581\u0627\u0644\u0639\u0644\u0627", "1083": "\u2581\u0622\u0644", "1084": "\u2581\u0648\u0627\u062d\u062f", "1085": "\u0647\u064a\u0645", "1086": "\u0627\u0628\u0644", "1087": "\u0647\u0645\u0629", "1088": "\u062d\u0642", "1089": "\u2581\u0627\u0644\u0634\u0631\u0643\u0629", "1090": "\u0643\u0648", "1091": "\u2581\u0628\u0633", "1092": "\u0639\u0627\u062f\u0629", "1093": "\u0634\u064a", "1094": "\u062a\u0631", "1095": "\u0627\u0639\u0629", "1096": "\u064a\u0627\u0621", "1097": "\u0627\u062a\u0647\u0627", "1098": "\u0631\u0648\u0641", "1099": "\u0645\u0639\u064a\u0629", "1100": "\u2581\u0627\u0644\u0634\u0639\u0628", "1101": "\u062d\u0644", "1102": "\u2581\u0648\u0627\u0644\u0633", "1103": "\u0631\u0633", "1104": "\u2581\u0627\u0644\u0645\u0631\u0643\u0632", "1105": "\u062c\u0632", "1106": "\u2581\u0648\u0645\u0639", "1107": "\u0627\u0639\u062a", "1108": "\u2581\u0641\u0631\u064a\u0642", "1109": "\u2581\u0627\u0644\u0639\u0631\u0627\u0642", "1110": "\u2581\u062f\u0627\u062e\u0644", "1111": "\u2581\u0627\u0628", "1112": "\u2581\u0627\u0644\u0627\u062d\u062a", "1113": "\u2581\u0627\u0644\u062e\u0637", "1114": "\u0644\u0627\u062b\u0629", "1115": "\u062e\u0628", "1116": "\u2581\u0627\u0644\u0648\u0644\u0627\u064a\u0627\u062a", "1117": "\u258118", "1118": "\u2581\u0627\u0644\u0644\u062c\u0646\u0629", "1119": "\u258112", "1120": "\u0641\u0638", "1121": "\u2581\u0637\u0631\u064a\u0642", "1122": "\u2581\u0627\u0644\u0645\u0647", "1123": "\u0642\u0627\u0637", "1124": "\u2581\u062a\u0648", "1125": "\u062c\u0647\u0629", "1126": "\u2581\u0628\u0627\u0644\u0646", "1127": "\u0627\u0628\u0639", "1128": "\u2581\u0648\u0647\u0630\u0627", "1129": "\u2581\u062a\u0628", "1130": "\u0648\u0633\u0637", "1131": "\u2581\u0628\u0635", "1132": "\u2581\u0627\u0644\u0646\u0627\u0633", "1133": "\u2581\u0648\u0627\u0644\u0634", "1134": "\u0636\u064a\u0629", "1135": "\u0627\u0646\u0629", "1136": "\u0623\u062a", "1137": "\u2581\u0636\u0645\u0646", "1138": "\u258115", "1139": "\u2581\u0639\u0634\u0631", "1140": "\u062a\u0645\u0631", "1141": "\u2581\u0627\u0644\u0628\u0646", "1142": "\u0637\u0642", "1143": "\u2581\u0639\u0644", "1144": "\u062d\u0627\u062a", "1145": "\u2581\u0623\u0642", "1146": "\u2581\u0648\u0633\u0644\u0645", "1147": "\u0639\u0636\u0627\u0621", "1148": "\u0645\u0633", "1149": "\u2581\u0627\u0644\u0641\u0644\u0633\u0637", "1150": "\u2581\u0635\u0644\u0649", "1151": "\u2581\u0635\u062d", "1152": "\u2581\u0648\u0625\u0646", "1153": "\u2581\u0628\u0642", "1154": "\u0648\u0644\u0647", "1155": "\u2581\u0627\u0644\u0627\u062c\u062a\u0645\u0627\u0639", "1156": "\u0636\u0627\u0621", "1157": "\u2581\u0627\u0644\u0639\u0631\u0628\u064a", "1158": "\u2581\u0627\u0644\u062c\u0647", "1159": "\u062c\u0627\u0646", "1160": "\u0642\u0627\u0641", "1161": "\u062f\u0627\u0621", "1162": "\u2581\u0648\u0639\u0644\u0649", "1163": "\u2581\u0639\u0645\u0631", "1164": "\u2581\u0627\u0644\u0622\u0646", "1165": "\u0639\u0649", "1166": "\u0631\u0627\u0636", "1167": "\u2581\u0633\u0645\u0648", "1168": "\u2581\u0623\u062d", "1169": "\u2581\u0627\u0644\u0644\u0627\u0639\u0628", "1170": "\u0628\u064a\u0631", "1171": "\u0645\u0628\u0631", "1172": "\u2581\u0627\u0644\u0645\u062e", "1173": "\u0627\u0644\u0649", "1174": "\u0645\u0644\u0629", "1175": "\u2581\u0627\u0644\u0644\u064a", "1176": "\u0648\u0627\u0642\u0639", "1177": "\u0631\u064a\u0637", "1178": "\u062a\u062e\u0627\u0628\u0627\u062a", "1179": "\u0633\u0628\u0648\u0639", "1180": "\u2581\u0627\u0644\u062b\u0627\u0644", "1181": "\u2581\u0627\u0644\u0645\u0627\u0644\u064a\u0629", "1182": "\u2581\u0645\u0631\u0643\u0632", "1183": "\u2581\u0627\u0644\u0623\u0645\u0631", "1184": "\u062c\u0627\u0632", "1185": "\u2581\u0627\u0644\u0638", "1186": "\u2581\u062c\u0627\u0621", "1187": "\u0644\u0627\u0628", "1188": "\u0637\u0644\u0642", "1189": "\u0627\u062f\u0631", "1190": "\u2581\u0636\u062f", "1191": "\u2581\u0625\u062f\u0627\u0631\u0629", "1192": "\u2581\u0627\u0644\u0648\u0632\u0631\u0627\u0621", "1193": "\u2581\u0627\u0644\u0627\u0642\u062a\u0635\u0627\u062f", "1194": "\u2581\u0627\u062e\u062a", "1195": "\u2581\u0646\u0633", "1196": "\u2581\u0628\u0627\u0644\u0625", "1197": "\u062c\u0628", "1198": "\u2581\u0643\u0628\u064a\u0631", "1199": "\u2581\u0623\u0628\u064a", "1200": "\u2581\u0623\u0644\u0641", "1201": "\u2581\u0644\u0639", "1202": "\u0641\u0631\u064a\u0642", "1203": "\u2581\u0644\u0644\u0639", "1204": "\u2581\u0648\u0642\u062a", "1205": "\u2581\u0644\u062f\u0649", "1206": "\u2581\u0645\u0633\u062a\u0648\u0649", "1207": "\u2581\u0627\u0644\u0628\u0631", "1208": "\u062c\u0627\u0644", "1209": "\u2581\u0627\u0644\u0648\u0627", "1210": "\u2581\u0623\u0647\u0645", "1211": "\u062c\u0627\u062a", "1212": "\u2581\u0644\u0644\u062d", "1213": "\u2581\u0639\u0627\u0645\u0627", "1214": "\u062e\u062f\u0627\u0645", "1215": "\u0648\u0645\u0627", "1216": "\u2581\u062a\u0631", "1217": "\u0631\u062d\u0644\u0629", "1218": "\u2581\u0627\u0644\u0642\u064a", "1219": "\u2581\u064a\u0642\u0648\u0644", "1220": "\u0631\u0627\u0633\u0629", "1221": "\u062f\u0627\u062f", "1222": "\u2581\u0627\u0644\u062e\u0644\u064a\u062c", "1223": "\u064a\u0627\u0647", "1224": "\u258111", "1225": "\u2581\u062d\u0644", "1226": "\u2581\u0627\u0644\u062a\u062f", "1227": "\u2581\u0627\u0644\u062f\u0648\u0644\u064a\u0629", "1228": "\u2581\u0627\u0644\u0645\u0642", "1229": "\u2581\u0630\u0643\u0631", "1230": "\u0637\u0628", "1231": "\u2581\u0639\u0646\u0647", "1232": "\u2581\u0643\u0628\u064a\u0631\u0629", "1233": "\u2581\u0644\u0644\u0634", "1234": "\u2581\u0644\u0647\u0645", "1235": "\u2581\u0648\u064a\u062a", "1236": "\u2581\u0627\u0644\u0634\u0628\u0627\u0628", "1237": "\u064a\u0643", "1238": "\u0627\u0631\u0628", "1239": "\u2581\u0623\u062e", "1240": "\u0627\u0642\u0629", "1241": "\u063a\u0644", "1242": "\u0636\u0648\u0631", "1243": "\u2581\u0635\u0627\u062d\u0628", "1244": "\u0627\u0647\u062f", "1245": "\u0627\u0644\u0628", "1246": "\u2581\u062c\u0632", "1247": "\u0624\u0648\u0646", "1248": "\u2581\u0627\u0644\u062f\u0648\u0644\u064a", "1249": "\u2581\u0627\u0644\u0633\u0627\u0628\u0642", "1250": "\u0627\u062b", "1251": "\u2581\u0627\u0644\u062a\u0642", "1252": "\u2581\u0627\u0644\u0639\u0644\u0645", "1253": "\u2581\u0623\u0646\u0647\u0627", "1254": "\u2581\u0648\u063a\u064a\u0631", "1255": "\u0647\u062a\u0645", "1256": "\u0627\u0639\u062f", "1257": "\u2581\u0627\u0644\u0634\u0631\u0642", "1258": "\u0639\u062a\u0628\u0631", "1259": "\u2581\u0648\u0639\u062f", "1260": "\u2581\u0627\u0644\u062e\u0627\u0635\u0629", "1261": "\u062f\u062a", "1262": "\u2581\u0627\u0644\u0642\u0637\u0627\u0639", "1263": "\u0648\u0636\u062d", "1264": "\u2581\u0627\u0644\u0639\u062f\u064a\u062f", "1265": "\u0635\u0648\u0635", "1266": "\u0627\u0643", "1267": "\u0633\u0643\u0631", "1268": "\u2581\u0645\u0634\u0627\u0631", "1269": "\u064a\u062f\u0627", "1270": "\u2581\u0646\u0634", "1271": "\u0628\u0631\u0627\u0647\u064a\u0645", "1272": "\u0648\u0631\u064a\u0627", "1273": "\u2581\u0627\u0644\u0628\u0637", "1274": "\u0627\u0645\u064a", "1275": "\u0627\u0647\u0631\u0629", "1276": "\u0648\u0621", "1277": "\u2581\u0646\u0641\u0633\u0647", "1278": "\u0639\u0644\u0646", "1279": "\u2581\u0642\u0631", "1280": "\u0645\u064a\u0646", "1281": "\u2581\u0627\u0644\u0633\u0646", "1282": "\u2581\u062d\u0633\u0646", "1283": "\u2581\u0648\u0636\u0639", "1284": "\u2581\u0627\u0644\u0645\u0648\u0627\u0637\u0646", "1285": "\u0647\u0646", "1286": "\u2581\u0627\u0644\u0643\u062a", "1287": "\u2581\u064a\u0624", "1288": "\u2581\u0641\u0639", "1289": "\u2581\u0641\u0627\u0644", "1290": "\u2581\u0627\u0644\u062a\u0635", "1291": "\u2581\u0627\u0644\u062a\u0639\u0644\u064a\u0645", "1292": "\u2581\u064a\u062c\u0628", "1293": "\u2581\u062c\u0627\u0646\u0628", "1294": "\u0633\u0633\u0629", "1295": "\u2581\u0644\u0634", "1296": "\u2581\u0644\u0627\u0639\u0628", "1297": "\u2581\u0628\u0648", "1298": "\u2581\u0627\u0644\u0642\u0627\u0646\u0648\u0646", "1299": "\u2581\u0627\u0644\u0623\u0646", "1300": "\u2581\u062c\u062f\u064a\u062f\u0629", "1301": "\u0626\u064a", "1302": "\u2581\u0645\u062e", "1303": "\u2581\u0627\u0644\u0648\u0637\u0646\u064a\u0629", "1304": "\u062e\u0631\u062c", "1305": "\u0627\u0626\u0628", "1306": "\u0637\u064a\u0629", "1307": "\u062a\u064a\u0646", "1308": "\u062f\u0645\u0627\u062a", "1309": "\u2581\u0646\u0641", "1310": "\u2581\u062e\u0627\u0644\u062f", "1311": "\u064a\u062a\u0647", "1312": "\u0634\u0629", "1313": "\u2581\u0645\u062c\u0645\u0648\u0639\u0629", "1314": "\u0636\u062d", "1315": "\u0644\u0639\u0628", "1316": "\u2581\u0627\u0645\u0633", "1317": "\u0637\u0644\u0628", "1318": "\u0645\u0627\u0646", "1319": "\u2581\u0644\u0627\u0646", "1320": "\u2581\u0627\u0644\u0627\u0631", "1321": "\u0637\u0641\u0627\u0644", "1322": "\u2581\u0644\u062f\u064a", "1323": "\u2581\u0627\u0644\u0633\u0644", "1324": "\u0642\u0631\u0627\u0631", "1325": "\u2581\u0639\u0645\u0644\u064a\u0629", "1326": "\u062b\u0646\u0627\u0621", "1327": "\u0646\u0627\u0646", "1328": "\u0647\u0627\u0628", "1329": "\u2581\u0648\u0627\u0644\u0630\u064a", "1330": "\u0627\u0628\u062a", "1331": "\u2581\u0627\u0644\u062d\u0631", "1332": "\u0632\u0627\u0644", "1333": "\u2581\u0645\u0634\u0631\u0648\u0639", "1334": "\u2581\u0627\u0644\u0639\u0627\u0644\u0645\u064a\u0629", "1335": "\u0628\u062f\u0623", "1336": "\u2581\u0627\u0644\u062b\u0627\u0646\u064a\u0629", "1337": "\u062a\u064a\u062c\u0629", "1338": "\u2581\u0628\u0643", "1339": "\u2581\u0628\u0627\u0646", "1340": "\u0646\u0639", "1341": "\u2581\u0639\u0642\u062f", "1342": "\u0643\u0627\u062a", "1343": "\u2581\u0627\u0644\u0646\u0641", "1344": "\u0633\u0633\u0627\u062a", "1345": "\u2581\u0648\u062c\u0647", "1346": "\u2581\u0648\u0643\u0627\u0646\u062a", "1347": "\u2581\u0644\u0644\u062f", "1348": "\u2581\u0645\u0648\u0636", "1349": "\u0631\u0628\u064a", "1350": "\u258113", "1351": "\u2581\u0623\u062c\u0644", "1352": "\u0631\u0628\u0629", "1353": "\u0637\u0644\u0627\u0642", "1354": "\u0627\u0647\u0631", "1355": "\u2581\u0645\u0634\u064a\u0631\u0627", "1356": "\u0627\u062f\u0627\u062a", "1357": "\u2581\u062a\u0631\u0643", "1358": "\u2581\u0647\u062f", "1359": "\u2581\u0641\u0644", "1360": "\u2581\u0628\u062f\u0627", "1361": "\u2581\u0639\u0636", "1362": "\u2581\u0648\u0623\u0643\u062f", "1363": "\u2581\u0627\u0644\u062a\u0649", "1364": "\u2581\u0627\u0644\u062f\u0627\u062e\u0644", "1365": "\u0638\u0647\u0631", "1366": "\u2581\u0634\u0631", "1367": "\u2581\u0627\u0644\u062a\u0623", "1368": "\u2581\u0627\u0644\u062d\u062f", "1369": "\u2581\u0627\u0644\u0645\u063a", "1370": "\u0628\u0627\u062d", "1371": "\u062f\u0647", "1372": "\u2581\u0630\u0627\u062a", "1373": "\u2581\u0623\u062c", "1374": "\u0647\u062f\u0627\u0641", "1375": "\u2581\u0634\u0647\u0631", "1376": "\u2581\u0639\u0644\u0627", "1377": "\u0627\u0646\u0627", "1378": "\u0648\u0628\u0629", "1379": "\u2581\u0627\u0644\u0633\u064a", "1380": "\u0627\u0626\u0631\u0629", "1381": "\u062c\u0627\u0647", "1382": "\u0633\u064a\u0627", "1383": "\u2581\u0627\u0644\u0628\u0644\u0627\u062f", "1384": "\u0646\u0627\u0645\u062c", "1385": "\u2581\u062d\u0645", "1386": "\u2581\u062f\u0648\u0644\u0629", "1387": "\u2581\u0631\u062d", "1388": "\u2581\u0645\u0633\u0624\u0648\u0644", "1389": "\u0635\u0627\u0631", "1390": "\u2581\u0639\u062f", "1391": "\u2581\u0627\u0644\u0643\u062b\u064a\u0631", "1392": "\u0642\u0645", "1393": "\u0646\u0641", "1394": "\u0627\u062f\u0645", "1395": "\u2581\u0635\u0641", "1396": "\u064a\u062f\u064a", "1397": "\u2581\u0645\u062c\u0627\u0644", "1398": "\u2581199", "1399": "\u0636\u0645\u0646", "1400": "\u2581\u0627\u0644\u0625\u0645\u0627\u0631\u0627\u062a", "1401": "\u0632\u0627\u0645", "1402": "\u2581\u0627\u0644\u0642\u0631", "1403": "\u0627\u0631\u0643", "1404": "\u0634\u0627\u0621", "1405": "\u2581\u0627\u0644\u0641\u062a\u0631\u0629", "1406": "\u0648\u0627\u0644", "1407": "\u2581\u0644\u0643", "1408": "\u2581\u0633\u0646\u0648\u0627\u062a", "1409": "\u0627\u0628\u064a\u0629", "1410": "\u2581\u0627\u0644\u0642\u062f\u0645", "1411": "\u2581\u0635\u0627\u0644\u062d", "1412": "\u2581\u0627\u0644\u0627\u0646\u062a", "1413": "\u2581\u062a\u0642\u062f\u0645", "1414": "\u0627\u064a", "1415": "\u0648\u0627\u0635\u0644", "1416": "\u2581\u0627\u0644\u0628\u0644\u062f", "1417": "\u2581\u0646\u0633\u0628\u0629", "1418": "\u2581\u0633\u0644", "1419": "\u2581\u0639\u0628", "1420": "\u0648\u0645\u0629", "1421": "\u2581\u0627\u0644\u062a\u0634", "1422": "\u2581\u0631\u0628", "1423": "\u2581\u0627\u0644\u0641\u0631", "1424": "\u2581\u0644\u062c\u0646\u0629", "1425": "\u2581\u0627\u0644\u0645\u0635\u0631", "1426": "\u2581\u062d\u062f\u062b", "1427": "\u2581\u0627\u0644\u0645\u0628\u0627\u0631\u0627\u0629", "1428": "\u0648\u064a\u0644", "1429": "\u2581\u0642\u0637\u0627\u0639", "1430": "\u0639\u0644\u0642", "1431": "\u2581\u0627\u0644\u0645\u062f\u064a\u0646\u0629", "1432": "\u2581\u0643\u0645", "1433": "\u0633\u0627\u0628", "1434": "\u2581\u062a\u062d\u0642\u064a\u0642", "1435": "\u2581\u0627\u062d\u062f", "1436": "\u0627\u0626\u0642", "1437": "\u2581\u0627\u0644\u0634\u0631\u0643\u0627\u062a", "1438": "\u2581\u0627\u0644\u0633\u0648\u0642", "1439": "\u2581\u062c\u062f\u0627", "1440": "\u2581\u062a\u0643", "1441": "\u2581\u0627\u062e", "1442": "\u2581\u0627\u0644\u062e\u0627\u0631\u062c\u064a\u0629", "1443": "\u2581\u0628\u064a\u0627\u0646", "1444": "\u2581\u0627\u0644\u0645\u0633\u0624\u0648\u0644", "1445": "\u0644\u064a\u0627", "1446": "\u2581\u0627\u0644\u062c\u062f\u064a\u062f", "1447": "\u2581\u0627\u0644\u0631\u0648", "1448": "\u062c\u064a\u0644", "1449": "\u0635\u0627\u062f\u0631", "1450": "\u2581\u0639\u0631\u0636", "1451": "\u2581\u0641\u0623", "1452": "\u2581\u0627\u0644\u062a\u0639\u0627\u0648\u0646", "1453": "\u0631\u064a\u0645", "1454": "\u2581\u0623\u0635", "1455": "\u2581\u0631\u064a\u0627\u0644", "1456": "\u2581\u062a\u0627\u0631\u064a\u062e", "1457": "\u258125", "1458": "\u2581\u062d\u0627\u0644\u0629", "1459": "\u2581\u0627\u0644\u0623\u0645\u0631\u064a", "1460": "\u062c\u0648\u0645", "1461": "\u0648\u062c\u062f", "1462": "\u2581\u0639\u062f\u0629", "1463": "\u2581\u0633\u0639\u0648\u062f", "1464": "\u2581\u0627\u0633\u0645", "1465": "\u2581\u0639\u0644\u0645", "1466": "\u0637\u0627\u0644\u0628", "1467": "\u2581\u0648\u0627\u0644\u0642", "1468": "\u2581\u0633\u0639\u062f", "1469": "\u2581\u062a\u0644", "1470": "\u2581\u0646\u0627\u062f\u064a", "1471": "\u2581\u0627\u0644\u0627\u0648\u0644", "1472": "\u2581\u0627\u0644\u062f\u064a\u0646", "1473": "\u2581\u0645\u0636", "1474": "\u2581\u062f\u064a", "1475": "\u2581\u0623\u063a", "1476": "\u2581\u0627\u0644\u0633\u064a\u0627\u0633\u064a\u0629", "1477": "\u2581\u0627\u0644\u062c\u0645", "1478": "\u0648\u0644\u0627\u062a", "1479": "\u2581\u0627\u062d\u0645\u062f", "1480": "\u2581\u062c\u062f\u064a\u062f", "1481": "\u2581\u062d\u0633\u0628", "1482": "\u0639\u0627\u064a\u0629", "1483": "\u2581\u062f\u0628\u064a", "1484": "\u0645\u062f\u0629", "1485": "\u0647\u064a", "1486": "\u0644\u0627\u062a", "1487": "\u2581\u0647\u0644", "1488": "\u2581\u064a\u0641", "1489": "\u062c\u0627\u062d", "1490": "\u0641\u0627\u0621", "1491": "\u2581\u0645\u0631\u0629", "1492": "\u0626\u064a\u0629", "1493": "\u2581\u0634\u064a\u0621", "1494": "\u2581\u0635\u062f", "1495": "\u2581\u0627\u0644\u0646\u0647\u0627", "1496": "\u0647\u0627\u0632", "1497": "\u2581\u0648\u0627\u0644\u0635", "1498": "\u0627\u0626\u062c", "1499": "\u2581\u0633\u0639\u064a\u062f", "1500": "\u2581\u0646\u0647\u0627\u064a\u0629", "1501": "\u062b\u0645\u0627\u0631", "1502": "\u0627\u0626\u064a", "1503": "\u0642\u0647", "1504": "\u2581\u0643\u062a\u0627\u0628", "1505": "\u0627\u0644\u0641", "1506": "\u2581\u0627\u0644\u0646\u0638\u0627\u0645", "1507": "\u2581\u0627\u0644\u062c\u0645\u0647", "1508": "\u2581\u062d\u0643\u0648\u0645", "1509": "\u2581\u0644\u0643\u0644", "1510": "\u2581\u0644\u0633", "1511": "\u2581\u0645\u062d\u0627", "1512": "\u0642\u0631\u064a\u0631", "1513": "\u0648\u064a\u0627\u062a", "1514": "\u0646\u064a\u0646", "1515": "\u062a\u062e\u0628", "1516": "\u2581\u0627\u0644\u0637\u0628\u064a", "1517": "\u2581\u0627\u0634", "1518": "\u0643\u0627\u0631", "1519": "\u2581\u062a\u062e", "1520": "\u258117", "1521": "\u2581\u0633\u064a\u062a", "1522": "\u062a\u0647\u0645", "1523": "\u2581\u0628\u0627\u0633\u0645", "1524": "\u0631\u064a\u0642\u0629", "1525": "\u2581\u0627\u0644\u0625\u0639\u0644\u0627\u0645", "1526": "\u0643\u0644\u0629", "1527": "\u062f\u0645\u0629", "1528": "\u2581\u0623\u0641", "1529": "\u2581\u0627\u0644\u0639\u062f", "1530": "\u2581\u0648\u0627\u0644\u0628", "1531": "\u2581\u0643\u0648\u0646", "1532": "\u2581\u0648\u0644\u062f", "1533": "\u0648\u0631\u0627", "1534": "\u2581\u0648\u0628\u0639\u062f", "1535": "\u2581\u0648\u0627\u0644\u062b", "1536": "\u0639\u064a\u0646", "1537": "\u2581\u0648\u062a\u0645", "1538": "\u2581\u0642\u0631\u0627\u0631", "1539": "\u0644\u0645\u064a\u0646", "1540": "\u0626\u0627\u0633\u0629", "1541": "\u2581\u062b\u0644\u0627\u062b\u0629", "1542": "\u2581\u0645\u0628", "1543": "\u0631\u0627\u0645", "1544": "\u2581\u0627\u0644\u0627\u0645\u064a\u0631", "1545": "\u2581\u0643\u064a\u0641", "1546": "\u0633\u0627\u0633", "1547": "\u2581\u0645\u0646\u062a", "1548": "\u2581\u0645\u0643", "1549": "\u2581\u0627\u0644\u0645\u0634\u0631\u0648\u0639", "1550": "\u2581\u0627\u0644\u062f\u0627\u062e\u0644\u064a\u0629", "1551": "\u258116", "1552": "\u2581\u0646\u0642\u0637\u0629", "1553": "\u062e\u0635\u0635", "1554": "\u2581\u0648\u0643\u0630\u0644\u0643", "1555": "\u062d\u0635", "1556": "\u0627\u0645\u0644\u0629", "1557": "\u0627\u062f\u062b", "1558": "\u2581\u0627\u0644\u062c\u062f\u064a\u062f\u0629", "1559": "\u2581\u0627\u0644\u062a\u0637", "1560": "\u062a\u0644", "1561": "\u258130", "1562": "\u2581\u0627\u0644\u0627\u062f", "1563": "\u2581\u062a\u0639\u062f", "1564": "\u2581\u0627\u0644\u0642\u0628", "1565": "\u2581\u0628\u064a\u0646\u0645\u0627", "1566": "\u2581\u0627\u0644\u0628\u062d\u0631", "1567": "\u2581\u0627\u0644\u0645\u0635\u0631\u064a", "1568": "\u0648\u0644\u064a", "1569": "\u2581\u0645\u0643\u0627\u0646", "1570": "\u2581\u0641\u0647\u062f", "1571": "\u2581\u0627\u0644\u0642\u062f", "1572": "\u2581\u0639\u0642", "1573": "\u2581\u0627\u0644\u0647\u064a\u0626\u0629", "1574": "\u0627\u062f\u0644", "1575": "\u062a\u0627", "1576": "\u0648\u0627\u0644\u064a", "1577": "\u2581\u062f\u064a\u0646", "1578": "\u2581\u0627\u0644\u0627\u062e", "1579": "\u2581\u0627\u062f", "1580": "\u2581\u0648\u064a\u0639", "1581": "\u0627\u062c\u0629", "1582": "\u2581\u0627\u0644\u0622\u062e\u0631", "1583": "\u2581\u0631\u0623", "1584": "\u2581\u0627\u0644\u0641\u0631\u0646", "1585": "\u0641\u0647", "1586": "\u2581\u0644\u062c", "1587": "\u0638\u0628\u064a", "1588": 