{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 39, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "gru", "trainable": true, "dtype": null, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "gru_1", "trainable": true, "dtype": null, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "gru_2", "trainable": true, "dtype": null, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 14, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.00010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "bidirectional/forward_gru/kernel", "shape": [256, 768], "dtype": "float32", "quantization": {"min": -0.913782114817802, "scale": 2.6926629974593412e-05, "dtype": "uint16"}}, {"name": "bidirectional/forward_gru/recurrent_kernel", "shape": [256, 768], "dtype": "float32", "quantization": {"min": -0.51598018805095, "scale": 1.538540084238155e-05, "dtype": "uint16"}}, {"name": "bidirectional/forward_gru/bias", "shape": [768], "dtype": "float32", "quantization": {"min": -0.2644045132489102, "scale": 7.436074844585037e-06, "dtype": "uint16"}}, {"name": "bidirectional/backward_gru/kernel", "shape": [256, 768], "dtype": "float32", "quantization": {"min": -0.7194025427505499, "scale": 2.202297626738964e-05, "dtype": "uint16"}}, {"name": "bidirectional/backward_gru/recurrent_kernel", "shape": [256, 768], "dtype": "float32", "quantization": {"min": -0.5142375119920088, "scale": 1.4703843307466013e-05, "dtype": "uint16"}}, {"name": "bidirectional/backward_gru/bias", "shape": [768], "dtype": "float32", "quantization": {"min": -0.23975986201662017, "scale": 6.7195387465771745e-06, "dtype": "uint16"}}, {"name": "bidirectional_1/forward_gru_1/kernel", "shape": [512, 768], "dtype": "float32", "quantization": {"min": -0.6978673714198792, "scale": 1.9589259548628187e-05, "dtype": "uint16"}}, {"name": "bidirectional_1/forward_gru_1/recurrent_kernel", "shape": [256, 768], "dtype": "float32", "quantization": {"min": -0.4537482475501372, "scale": 1.3608092836796341e-05, "dtype": "uint16"}}, {"name": "bidirectional_1/forward_gru_1/bias", "shape": [768], "dtype": "float32", "quantization": {"min": -0.18479765489603095, "scale": 6.1486493061397755e-06, "dtype": "uint16"}}, {"name": "bidirectional_1/backward_gru_1/kernel", "shape": [512, 768], "dtype": "float32", "quantization": {"min": -0.6235670498836828, "scale": 2.0803598114488652e-05, "dtype": "uint16"}}, {"name": "bidirectional_1/backward_gru_1/recurrent_kernel", "shape": [256, 768], "dtype": "float32", "quantization": {"min": -0.5866991471551217, "scale": 1.582124281086001e-05, "dtype": "uint16"}}, {"name": "bidirectional_1/backward_gru_1/bias", "shape": [768], "dtype": "float32", "quantization": {"min": -0.28706531716746414, "scale": 7.800687966507177e-06, "dtype": "uint16"}}, {"name": "bidirectional_2/forward_gru_2/kernel", "shape": [512, 768], "dtype": "float32", "quantization": {"min": -0.339637472435458, "scale": 1.0896992827113e-05, "dtype": "uint16"}}, {"name": "bidirectional_2/forward_gru_2/recurrent_kernel", "shape": [256, 768], "dtype": "float32", "quantization": {"min": -0.43164422137700714, "scale": 1.1410706920191581e-05, "dtype": "uint16"}}, {"name": "bidirectional_2/forward_gru_2/bias", "shape": [768], "dtype": "float32", "quantization": {"min": -0.2766444816519755, "scale": 4.889352992205432e-06, "dtype": "uint16"}}, {"name": "bidirectional_2/backward_gru_2/kernel", "shape": [512, 768], "dtype": "float32", "quantization": {"min": -0.4915163700368863, "scale": 1.4218414476464067e-05, "dtype": "uint16"}}, {"name": "bidirectional_2/backward_gru_2/recurrent_kernel", "shape": [256, 768], "dtype": "float32", "quantization": {"min": -0.4437098892364275, "scale": 1.4439450982343307e-05, "dtype": "uint16"}}, {"name": "bidirectional_2/backward_gru_2/bias", "shape": [768], "dtype": "float32", "quantization": {"min": -0.3236049807225393, "scale": 8.624866223948276e-06, "dtype": "uint16"}}, {"name": "dense/kernel", "shape": [512, 128], "dtype": "float32", "quantization": {"min": -0.3434702445833709, "scale": 9.71132788349273e-06, "dtype": "uint16"}}, {"name": "dense/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -0.14766888466655204, "scale": 2.729251555586294e-06, "dtype": "uint16"}}, {"name": "dense_1/kernel", "shape": [128, 14], "dtype": "float32", "quantization": {"min": -0.44702604279016445, "scale": 1.0859635671707425e-05, "dtype": "uint16"}}, {"name": "dense_1/bias", "shape": [14], "dtype": "float32", "quantization": {"min": -0.06557385457526577, "scale": 1.890281192714493e-06, "dtype": "uint16"}}, {"name": "embedding/embeddings", "shape": [39, 256], "dtype": "float32", "quantization": {"min": -0.40924108652834984, "scale": 1.1675589470438784e-05, "dtype": "uint16"}}]}]}