{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.2.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1024], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 17, 1024], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "reshape", "class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1024]}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "dense", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1024, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1024, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"name": "add", "class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["dense", 0, 0, {}], ["dense_1", 0, 0, {}]]]}, {"name": "activation", "class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "tanh"}, "inbound_nodes": [[["add", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"name": "permute", "class_name": "Permute", "config": {"name": "permute", "trainable": true, "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["permute", 0, 0, {}]]]}, {"name": "permute_1", "class_name": "Permute", "config": {"name": "permute_1", "trainable": true, "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "multiply", "class_name": "Multiply", "config": {"name": "multiply", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["permute_1", 0, 0, {}], ["input_2", 0, 0, {}]]]}, {"name": "permute_2", "class_name": "Permute", "config": {"name": "permute_2", "trainable": true, "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["multiply", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["permute_2", 0, 0, {}]]]}, {"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_4"}, "inbound_nodes": []}, {"name": "permute_3", "class_name": "Permute", "config": {"name": "permute_3", "trainable": true, "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 16754, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "concatenate", "class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["permute_3", 0, 0, {}], ["embedding_1", 0, 0, {}]]]}, {"name": "gru_1", "class_name": "GRU", "config": {"name": "gru_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 1024, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}, "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [1024]}, "inbound_nodes": [[["gru_1", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 16754, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}], "input_layers": [["input_4", 0, 0], ["input_3", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_4", 0, 0], ["gru_1", 0, 1]]}}}, "weightsManifest": [{"paths": ["group1-shard1of8.bin", "group1-shard2of8.bin", "group1-shard3of8.bin", "group1-shard4of8.bin", "group1-shard5of8.bin", "group1-shard6of8.bin", "group1-shard7of8.bin", "group1-shard8of8.bin"], "weights": [{"name": "dense/kernel", "shape": [1024, 1024], "dtype": "float32", "quantization": {"min": -0.51482953043545, "scale": 0.004219914183897131, "dtype": "uint8"}}, {"name": "dense/bias", "shape": [1024], "dtype": "float32", "quantization": {"min": -0.3380207664826337, "scale": 0.0026203160192452223, "dtype": "uint8"}}, {"name": "dense_1/kernel", "shape": [1024, 1024], "dtype": "float32", "quantization": {"min": -0.6511748271829941, "scale": 0.005047866877387551, "dtype": "uint8"}}, {"name": "dense_1/bias", "shape": [1024], "dtype": "float32", "quantization": {"min": -0.3380207815591027, "scale": 0.002620316136117075, "dtype": "uint8"}}, {"name": "dense_2/kernel", "shape": [1024, 1], "dtype": "float32", "quantization": {"min": -0.21978441465134715, "scale": 0.0019111688230551926, "dtype": "uint8"}}, {"name": "dense_2/bias", "shape": [1], "dtype": "float32", "quantization": {"min": 0.3711811602115631, "scale": 1.0, "dtype": "uint8"}}, {"name": "dense_3/kernel", "shape": [17, 1], "dtype": "float32", "quantization": {"min": -1.5162550603642184, "scale": 0.008714109542323094, "dtype": "uint8"}}, {"name": "dense_3/bias", "shape": [1], "dtype": "float32", "quantization": {"min": -0.045158468186855316, "scale": 1.0, "dtype": "uint8"}}, {"name": "dense_4/kernel", "shape": [1024, 16754], "dtype": "float32", "quantization": {"min": -1.9616641549503102, "scale": 0.015568763134526271, "dtype": "uint8"}}, {"name": "dense_4/bias", "shape": [16754], "dtype": "float32", "quantization": {"min": -0.5243021806081136, "scale": 0.0038551630927067177, "dtype": "uint8"}}, {"name": "embedding_1/embeddings", "shape": [16754, 256], "dtype": "float32", "quantization": {"min": -0.5758342266082764, "scale": 0.004362380504608155, "dtype": "uint8"}}, {"name": "gru_1/kernel", "shape": [1280, 3072], "dtype": "float32", "quantization": {"min": -1.2259690004236559, "scale": 0.00921781203326057, "dtype": "uint8"}}, {"name": "gru_1/recurrent_kernel", "shape": [1024, 3072], "dtype": "float32", "quantization": {"min": -0.038123170637032563, "scale": 0.00030018244596088635, "dtype": "uint8"}}, {"name": "gru_1/bias", "shape": [3072], "dtype": "float32", "quantization": {"min": -0.27124507450589946, "scale": 0.001910176581027461, "dtype": "uint8"}}]}]}