{"modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_4", "layers": [{"name": "input_8", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "name": "input_8"}, "inbound_nodes": []}, {"name": "input_7", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 49, 256], "dtype": "float32", "sparse": false, "name": "input_7"}, "inbound_nodes": []}, {"name": "reshape_2", "class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "dtype": "float32", "target_shape": [1, 256]}, "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"name": "dense_14", "class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"name": "dense_15", "class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["dense_14", 0, 0, {}], ["dense_15", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "dtype": "float32", "activation": "tanh"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "dense_16", "class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "permute_4", "class_name": "Permute", "config": {"name": "permute_4", "trainable": true, "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["dense_16", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["permute_4", 0, 0, {}]]]}, {"name": "permute_5", "class_name": "Permute", "config": {"name": "permute_5", "trainable": true, "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "multiply_1", "class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["permute_5", 0, 0, {}], ["input_7", 0, 0, {}]]]}, {"name": "permute_6", "class_name": "Permute", "config": {"name": "permute_6", "trainable": true, "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["multiply_1", 0, 0, {}]]]}, {"name": "dense_17", "class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["permute_6", 0, 0, {}]]]}, {"name": "input_9", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_9"}, "inbound_nodes": []}, {"name": "permute_7", "class_name": "Permute", "config": {"name": "permute_7", "trainable": true, "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["dense_17", 0, 0, {}]]]}, {"name": "embedding_2", "class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 15791, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["permute_7", 0, 0, {}], ["embedding_2", 0, 0, {}]]]}, {"name": "gru_2", "class_name": "GRU", "config": {"name": "gru_2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "dense_18", "class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["gru_2", 0, 0, {}]]]}, {"name": "reshape_3", "class_name": "Reshape", "config": {"name": "reshape_3", "trainable": true, "dtype": "float32", "target_shape": [256]}, "inbound_nodes": [[["dense_18", 0, 0, {}]]]}, {"name": "dense_19", "class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "dtype": "float32", "units": 15791, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_3", 0, 0, {}]]]}], "input_layers": [["input_9", 0, 0], ["input_8", 0, 0], ["input_7", 0, 0]], "output_layers": [["dense_19", 0, 0], ["gru_2", 0, 1]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "dense_14/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "dense_14/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "dense_15/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "dense_15/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "dense_16/kernel", "shape": [256, 1], "dtype": "float32"}, {"name": "dense_16/bias", "shape": [1], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "dense_17/kernel", "shape": [49, 1], "dtype": "float32"}, {"name": "dense_17/bias", "shape": [1], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "dense_18/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "dense_18/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group6-shard1of4", "group6-shard2of4", "group6-shard3of4", "group6-shard4of4"], "weights": [{"name": "dense_19/kernel", "shape": [256, 15791], "dtype": "float32"}, {"name": "dense_19/bias", "shape": [15791], "dtype": "float32"}]}, {"paths": ["group7-shard1of4", "group7-shard2of4", "group7-shard3of4", "group7-shard4of4"], "weights": [{"name": "embedding_2/embeddings", "shape": [15791, 256], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "gru_2/kernel", "shape": [512, 768], "dtype": "float32"}, {"name": "gru_2/recurrent_kernel", "shape": [256, 768], "dtype": "float32"}, {"name": "gru_2/bias", "shape": [768], "dtype": "float32"}]}]}