{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.2.2.1", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_7", "trainable": true, "batch_input_shape": [null, 315], "dtype": "float32", "input_dim": 149, "output_dim": 288, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 315}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_19", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_19", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 288, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.2, "implementation": 1}}, "merge_mode": "concat"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_13", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_20", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_20", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 144, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.2, "implementation": 1}}, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_21", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_21", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 96, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.2, "implementation": 1}}, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "units": 28, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 9.999999747378752e-05, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "sparse_categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_13/gamma", "shape": [576], "dtype": "float32", "quantization": {"min": 0.8366863131523132, "scale": 0.001586592664905623, "dtype": "uint8"}}, {"name": "batch_normalization_13/beta", "shape": [576], "dtype": "float32", "quantization": {"min": -0.24735563783084644, "scale": 0.0017177474849364336, "dtype": "uint8"}}, {"name": "batch_normalization_13/moving_mean", "shape": [576], "dtype": "float32", "quantization": {"min": -0.3139945906751296, "scale": 0.0038764764280880197, "dtype": "uint8"}}, {"name": "batch_normalization_13/moving_variance", "shape": [576], "dtype": "float32", "quantization": {"min": 0.002573181875050068, "scale": 0.0006916169844129506, "dtype": "uint8"}}, {"name": "bidirectional_19/forward_lstm_19/kernel", "shape": [288, 1152], "dtype": "float32", "quantization": {"min": -0.5674235423405966, "scale": 0.00436479647954305, "dtype": "uint8"}}, {"name": "bidirectional_19/forward_lstm_19/recurrent_kernel", "shape": [288, 1152], "dtype": "float32", "quantization": {"min": -0.5823888708563412, "scale": 0.004813131164101993, "dtype": "uint8"}}, {"name": "bidirectional_19/forward_lstm_19/bias", "shape": [1152], "dtype": "float32", "quantization": {"min": -0.297871660601859, "scale": 0.00562022001135583, "dtype": "uint8"}}, {"name": "bidirectional_19/backward_lstm_19/kernel", "shape": [288, 1152], "dtype": "float32", "quantization": {"min": -0.5321208448971019, "scale": 0.004434340374142516, "dtype": "uint8"}}, {"name": "bidirectional_19/backward_lstm_19/recurrent_kernel", "shape": [288, 1152], "dtype": "float32", "quantization": {"min": -0.5339531232328976, "scale": 0.003955208320243686, "dtype": "uint8"}}, {"name": "bidirectional_19/backward_lstm_19/bias", "shape": [1152], "dtype": "float32", "quantization": {"min": -0.2005143744104049, "scale": 0.004774151771676307, "dtype": "uint8"}}, {"name": "bidirectional_20/forward_lstm_20/kernel", "shape": [576, 576], "dtype": "float32", "quantization": {"min": -0.3066141691862368, "scale": 0.002340566176994174, "dtype": "uint8"}}, {"name": "bidirectional_20/forward_lstm_20/recurrent_kernel", "shape": [144, 576], "dtype": "float32", "quantization": {"min": -0.5947546257692224, "scale": 0.005127195049734677, "dtype": "uint8"}}, {"name": "bidirectional_20/forward_lstm_20/bias", "shape": [576], "dtype": "float32", "quantization": {"min": -0.10071395249927745, "scale": 0.004795902499965593, "dtype": "uint8"}}, {"name": "bidirectional_20/backward_lstm_20/kernel", "shape": [576, 576], "dtype": "float32", "quantization": {"min": -0.31146538678337543, "scale": 0.0022569955564012713, "dtype": "uint8"}}, {"name": "bidirectional_20/backward_lstm_20/recurrent_kernel", "shape": [144, 576], "dtype": "float32", "quantization": {"min": -0.6385029250500249, "scale": 0.004560735178928749, "dtype": "uint8"}}, {"name": "bidirectional_20/backward_lstm_20/bias", "shape": [576], "dtype": "float32", "quantization": {"min": -0.08259699522864584, "scale": 0.004347210275191886, "dtype": "uint8"}}, {"name": "bidirectional_21/forward_lstm_21/kernel", "shape": [288, 384], "dtype": "float32", "quantization": {"min": -0.5574394212049596, "scale": 0.004724062891567455, "dtype": "uint8"}}, {"name": "bidirectional_21/forward_lstm_21/recurrent_kernel", "shape": [96, 384], "dtype": "float32", "quantization": {"min": -0.43351604798260857, "scale": 0.0034406035554175284, "dtype": "uint8"}}, {"name": "bidirectional_21/forward_lstm_21/bias", "shape": [384], "dtype": "float32", "quantization": {"min": -0.056878358374039324, "scale": 0.004375258336464564, "dtype": "uint8"}}, {"name": "bidirectional_21/backward_lstm_21/kernel", "shape": [288, 384], "dtype": "float32", "quantization": {"min": -0.6230357805887858, "scale": 0.004581145445505778, "dtype": "uint8"}}, {"name": "bidirectional_21/backward_lstm_21/recurrent_kernel", "shape": [96, 384], "dtype": "float32", "quantization": {"min": -0.5218904298894546, "scale": 0.0037277887849246753, "dtype": "uint8"}}, {"name": "bidirectional_21/backward_lstm_21/bias", "shape": [384], "dtype": "float32", "quantization": {"min": -0.047583097204858184, "scale": 0.004325736109532562, "dtype": "uint8"}}, {"name": "dense_7/kernel", "shape": [192, 28], "dtype": "float32", "quantization": {"min": -0.7407584725641736, "scale": 0.00583274387845806, "dtype": "uint8"}}, {"name": "dense_7/bias", "shape": [28], "dtype": "float32", "quantization": {"min": -0.06901573094667174, "scale": 0.000415757415341396, "dtype": "uint8"}}, {"name": "embedding_7/embeddings", "shape": [149, 288], "dtype": "float32", "quantization": {"min": -0.611006186990177, "scale": 0.00526729471543256, "dtype": "uint8"}}]}]}