{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.2.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [1, null], "dtype": "float32", "input_dim": 40, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "GRU", "config": {"name": "gru_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": true, "unroll": false, "time_major": false, "units": 1024, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 40, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_1/kernel", "shape": [1024, 40], "dtype": "float32", "quantization": {"min": -0.5385000476650162, "scale": 0.00411068738675585, "dtype": "uint8"}}, {"name": "dense_1/bias", "shape": [40], "dtype": "float32", "quantization": {"min": -0.06550039350986481, "scale": 0.0005198443929354349, "dtype": "uint8"}}, {"name": "embedding_1/embeddings", "shape": [40, 256], "dtype": "float32", "quantization": {"min": -1.3870253852769439, "scale": 0.011369060535056917, "dtype": "uint8"}}, {"name": "gru_1/kernel", "shape": [256, 3072], "dtype": "float32", "quantization": {"min": -1.0283318540629218, "scale": 0.007731818451600916, "dtype": "uint8"}}, {"name": "gru_1/recurrent_kernel", "shape": [1024, 3072], "dtype": "float32", "quantization": {"min": -0.899892248359381, "scale": 0.006922248064302931, "dtype": "uint8"}}, {"name": "gru_1/bias", "shape": [3072], "dtype": "float32", "quantization": {"min": -0.3067380666732788, "scale": 0.0016491293907165527, "dtype": "uint8"}}]}]}