{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_2", "layers": [{"class_name": "Conv1D", "config": {"name": "conv1d_14", "trainable": true, "batch_input_shape": [null, 44100, 1], "dtype": "float32", "filters": 16, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_14", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_15", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_15", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_16", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_16", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_17", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_17", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_18", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_18", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_19", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_19", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_20", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_20", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}, "loss": "sparse_categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv1d_14/kernel", "shape": [3, 1, 16], "dtype": "float32", "quantization": {"min": -0.4306004468132468, "scale": 0.0034174638635971967, "dtype": "uint8"}}, {"name": "conv1d_14/bias", "shape": [16], "dtype": "float32", "quantization": {"min": -0.01347053475020563, "scale": 0.00013887149227016112, "dtype": "uint8"}}, {"name": "conv1d_15/kernel", "shape": [3, 16, 32], "dtype": "float32", "quantization": {"min": -0.37477328356574563, "scale": 0.0025494781194948684, "dtype": "uint8"}}, {"name": "conv1d_15/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -0.047358477115631105, "scale": 0.00030953253016752355, "dtype": "uint8"}}, {"name": "conv1d_16/kernel", "shape": [3, 32, 64], "dtype": "float32", "quantization": {"min": -0.27349349914812576, "scale": 0.001953524993915184, "dtype": "uint8"}}, {"name": "conv1d_16/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.056370657959989474, "scale": 0.000388763158344755, "dtype": "uint8"}}, {"name": "conv1d_17/kernel", "shape": [3, 64, 64], "dtype": "float32", "quantization": {"min": -0.2642356992352243, "scale": 0.001900976253490822, "dtype": "uint8"}}, {"name": "conv1d_17/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.04412550895529635, "scale": 0.0002865292789304958, "dtype": "uint8"}}, {"name": "conv1d_18/kernel", "shape": [3, 64, 64], "dtype": "float32", "quantization": {"min": -0.28519282831865195, "scale": 0.002066614697961246, "dtype": "uint8"}}, {"name": "conv1d_18/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.07719884082382801, "scale": 0.0004386297774081137, "dtype": "uint8"}}, {"name": "conv1d_19/kernel", "shape": [3, 64, 64], "dtype": "float32", "quantization": {"min": -0.25656184168422924, "scale": 0.0019436503157896155, "dtype": "uint8"}}, {"name": "conv1d_19/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.08070264037917642, "scale": 0.0005416284589206471, "dtype": "uint8"}}, {"name": "conv1d_20/kernel", "shape": [3, 64, 64], "dtype": "float32", "quantization": {"min": -0.2915203734940174, "scale": 0.002082288382100124, "dtype": "uint8"}}, {"name": "conv1d_20/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.026090906896427568, "scale": 0.00027464112522555334, "dtype": "uint8"}}, {"name": "dense_4/kernel", "shape": [22016, 128], "dtype": "float32", "quantization": {"min": -0.20432952806061389, "scale": 0.0015717656004662606, "dtype": "uint8"}}, {"name": "dense_4/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -0.03612637105671798, "scale": 0.00019422780138020422, "dtype": "uint8"}}, {"name": "dense_5/kernel", "shape": [128, 10], "dtype": "float32", "quantization": {"min": -0.3344471561558106, "scale": 0.0022751507221483716, "dtype": "uint8"}}, {"name": "dense_5/bias", "shape": [10], "dtype": "float32", "quantization": {"min": -0.05500393530317381, "scale": 0.0005189050500299416, "dtype": "uint8"}}]}]}